### 常用操作

In [1]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                     'data':[1,2,3,4,5,6,7,8,9]})
data

  group  data
0     a     1
1     a     2
2     a     3
3     b     4
4     b     5
5     b     6
6     c     7
7     c     8
8     c     9

In [2]:
data.sort_values(by=['group','data'],ascending=[False,True],inplace=True) #先按照group降序 再按照data升序
data

  group  data
6     c     7
7     c     8
8     c     9
3     b     4
4     b     5
5     b     6
0     a     1
1     a     2
2     a     3

In [3]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                     'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [4]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
data.drop_duplicates()  #去除重复的数据

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [6]:
data.drop_duplicates(subset='k1') #去除k1中重复的数据

    k1  k2
0  one   3
3  two   3

In [7]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [8]:
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'
data['foof_map'] = data.apply(food_map,axis='columns')  #对每一行数据都调用一次自定义的food_map
data

  food  data foof_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [9]:
food2Upper = {
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C',
}
data['upper'] = data['food'].map(food2Upper)
data

  food  data foof_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [10]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
df

      data1     data2
0  1.775090  1.150306
1  0.448353  1.003735
2  0.621385  1.565838
3 -0.166638  0.132968
4  0.388800 -1.297762

In [11]:
df2 = df.assign(ration = df['data1']/df['data2'])
df2

      data1     data2    ration
0  1.775090  1.150306  1.543145
1  0.448353  1.003735  0.446685
2  0.621385  1.565838  0.396839
3 -0.166638  0.132968 -1.253217
4  0.388800 -1.297762 -0.299593

In [12]:
df2.drop('ration',axis='columns',inplace=True)
df2

      data1     data2
0  1.775090  1.150306
1  0.448353  1.003735
2  0.621385  1.565838
3 -0.166638  0.132968
4  0.388800 -1.297762

In [13]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data.replace(9,np.nan,inplace=True)
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [14]:
age = [15,18,20,35,40,67,32,79,67,77,45,38]
bins = [10,40,60,80]
bins_res = pd.cut(age,bins=bins)
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], ..., (60, 80], (60, 80], (60, 80], (40, 60], (10, 40]]
Length: 12
Categories (3, interval[int64, right]): [(10, 40] < (40, 60] < (60, 80]]

In [15]:
bins_res.codes       # 可以筛选出不同区间的数据 做成标签

array([0, 0, 0, 0, 0, 2, 0, 2, 2, 2, 1, 0], dtype=int8)

In [16]:
pd.value_counts(bins_res)  # 统计区间中值的个数

C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\1204263753.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(bins_res)  # 统计区间中值的个数

(10, 40]    7
(60, 80]    4
(40, 60]    1
Name: count, dtype: int64

In [17]:
pd.cut(age,bins=[0,30,50,60,80])

[(0, 30], (0, 30], (0, 30], (30, 50], (30, 50], ..., (60, 80], (60, 80], (60, 80], (30, 50], (30, 50]]
Length: 12
Categories (4, interval[int64, right]): [(0, 30] < (30, 50] < (50, 60] < (60, 80]]

In [18]:
grounp_name = ['Young','Middle','Old']
test = pd.cut(age,bins=[10,20,50,80],labels=grounp_name)  # 可以指定组名 
test

['Young', 'Young', 'Young', 'Middle', 'Middle', ..., 'Old', 'Old', 'Old', 'Middle', 'Middle']
Length: 12
Categories (3, object): ['Young' < 'Middle' < 'Old']

In [19]:
pd.value_counts(test)

C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\3620688634.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(test)

Middle    5
Old       4
Young     3
Name: count, dtype: int64

In [20]:
df = pd.DataFrame([range(3),
                   [0,np.nan,0],
                   [0,0,np.nan],
                   range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [21]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [22]:
df.isnull().any()   # 查看哪一列有缺失值

0    False
1     True
2     True
dtype: bool

In [23]:
df.isnull().any(axis=1)  # 查看哪一行有缺失值

0    False
1     True
2     True
3    False
dtype: bool

In [24]:
df.fillna(100)   # 填充缺失值

   0      1      2
0  0    1.0    2.0
1  0  100.0    0.0
2  0    0.0  100.0
3  0    1.0    2.0

### groupby操作

In [25]:
df = pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                   'B':['one','one','two','three','two','two','one','three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.644507  0.803036
1  bar    one  2.057919 -0.228266
2  foo    two  0.905365 -0.182988
3  bar  three -0.089802 -0.268201
4  foo    two  0.522350  0.444080
5  bar    two -0.185772  0.639170
6  foo    one  1.020152  1.618961
7  foo  three  0.835487  0.398651

In [26]:
grouped = df.groupby(by='A')
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [27]:
grouped = df.groupby(by=['A','B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [28]:
s = pd.Series(data=[1,2,3,1,2,3],index=[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [29]:
grouped = s.groupby(level=0)
grouped.first()

5    3
7    2
8    1
dtype: int64

In [30]:
grouped.last()

5    3
7    2
8    1
dtype: int64

In [31]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [32]:
grouped = s.groupby(level=0,sort=False) # 如果sort没有设置为false 会自动排序
grouped.first()

8    1
7    2
5    3
dtype: int64

In [33]:
df2 = pd.DataFrame({'X':['A','B','A','B'],
                    'Y':[1,2,3,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [34]:
df2.groupby('X').get_group('A')    # 按照X列中的数据进行分组，单独查看分组A的DataFrame

   X  Y
0  A  1
2  A  3

In [35]:
arrays = [['汽车','汽车','树','树','电脑','电脑','灯','灯'],
          ['电动','燃油','苹果','芒果','手提','台式','LED','白炽灯']]
arrays

[['汽车', '汽车', '树', '树', '电脑', '电脑', '灯', '灯'],
 ['电动', '燃油', '苹果', '芒果', '手提', '台式', 'LED', '白炽灯']]

In [36]:
index = pd.MultiIndex.from_arrays(arrays,names=['index1','index2'])   # 构造多重索引
index

MultiIndex([('汽车',  '电动'),
            ('汽车',  '燃油'),
            ( '树',  '苹果'),
            ( '树',  '芒果'),
            ('电脑',  '手提'),
            ('电脑',  '台式'),
            ( '灯', 'LED'),
            ( '灯', '白炽灯')],
           names=['index1', 'index2'])

In [37]:
s = pd.Series(np.random.randn(8),index=index)
s

index1  index2
汽车      电动        1.490680
        燃油       -0.281913
树       苹果        0.334993
        芒果       -0.544927
电脑      手提       -0.922375
        台式        0.687332
灯       LED      -1.001831
        白炽灯       0.384907
dtype: float64

### 分组依据：
# by：基于列的值。
# level：基于索引级别的值。
### 参数类型：
# by：通常用于列名或与列相关的函数。
# level：用于指定索引级别的位置或名称。

In [38]:
s.groupby(by='index1',sort=False).sum()

index1
汽车    1.208767
树    -0.209934
电脑   -0.235043
灯    -0.616924
dtype: float64

In [39]:
s.groupby(level='index1',sort=False).sum()

index1
汽车    1.208767
树    -0.209934
电脑   -0.235043
灯    -0.616924
dtype: float64

In [40]:
df

     A      B         C         D
0  foo    one  0.644507  0.803036
1  bar    one  2.057919 -0.228266
2  foo    two  0.905365 -0.182988
3  bar  three -0.089802 -0.268201
4  foo    two  0.522350  0.444080
5  bar    two -0.185772  0.639170
6  foo    one  1.020152  1.618961
7  foo  three  0.835487  0.398651

In [41]:
grouped = df.groupby(['A','B'])
grouped.agg(np.sum)

C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\2369893681.py:2: FutureWarning: The provided callable <function sum at 0x0000025E752A85E0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped.agg(np.sum)

                  C         D
A   B
bar one    2.057919 -0.228266
    three -0.089802 -0.268201
    two   -0.185772  0.639170
foo one    1.664659  2.421998
    three  0.835487  0.398651
    two    1.427716  0.261092

In [42]:
grouped.sum()

                  C         D
A   B
bar one    2.057919 -0.228266
    three -0.089802 -0.268201
    two   -0.185772  0.639170
foo one    1.664659  2.421998
    three  0.835487  0.398651
    two    1.427716  0.261092

In [43]:
grouped = df.groupby(['A','B'],as_index=False)
grouped.agg(np.sum)

C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\2971850898.py:2: FutureWarning: The provided callable <function sum at 0x0000025E752A85E0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped.agg(np.sum)

     A      B         C         D
0  bar    one  2.057919 -0.228266
1  bar  three -0.089802 -0.268201
2  bar    two -0.185772  0.639170
3  foo    one  1.664659  2.421998
4  foo  three  0.835487  0.398651
5  foo    two  1.427716  0.261092

In [44]:
df.groupby(['A','B']).sum().reset_index()

     A      B         C         D
0  bar    one  2.057919 -0.228266
1  bar  three -0.089802 -0.268201
2  bar    two -0.185772  0.639170
3  foo    one  1.664659  2.421998
4  foo  three  0.835487  0.398651
5  foo    two  1.427716  0.261092

In [45]:
grouped.size()

     A      B  size
0  bar    one     1
1  bar  three     1
2  bar    two     1
3  foo    one     2
4  foo  three     1
5  foo    two     2

In [46]:
grouped.describe()

     A      B     C                                                    \
              count      mean       std       min       25%       50%
0  bar    one   1.0  2.057919       NaN  2.057919  2.057919  2.057919
1  bar  three   1.0 -0.089802       NaN -0.089802 -0.089802 -0.089802
2  bar    two   1.0 -0.185772       NaN -0.185772 -0.185772 -0.185772
3  foo    one   2.0  0.832330  0.265621  0.644507  0.738418  0.832330
4  foo  three   1.0  0.835487       NaN  0.835487  0.835487  0.835487
5  foo    two   2.0  0.713858  0.270832  0.522350  0.618104  0.713858

                          D                                                    \
        75%       max count      mean       std       min       25%       50%
0  2.057919  2.057919   1.0 -0.228266       NaN -0.228266 -0.228266 -0.228266
1 -0.089802 -0.089802   1.0 -0.268201       NaN -0.268201 -0.268201 -0.268201
2 -0.185772 -0.185772   1.0  0.639170       NaN  0.639170  0.639170  0.639170
3  0.926241  1.020152   2.0  1.210999  0.576946  0.803036  1.007018  1.210999
4  0.835487  0.835487   1.0  0.398651       NaN  0.398651  0.398651  0.398651
5  0.809611  0.905365   2.0  0.130546  0.443404 -0.182988 -0.026221  0.130546


        75%       max
0 -0.228266 -0.228266
1 -0.268201 -0.268201
2  0.639170  0.639170
3  1.414980  1.618961
4  0.398651  0.398651
5  0.287313  0.444080

In [49]:
grouped = df.groupby('A')
grouped['C'].agg(res_sum=np.sum,res_mean=np.mean,res_std=np.std)

C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\3284721652.py:2: FutureWarning: The provided callable <function sum at 0x0000025E752A85E0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped['C'].agg(res_sum=np.sum,res_mean=np.mean,res_std=np.std)
C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\3284721652.py:2: FutureWarning: The provided callable <function mean at 0x0000025E752A96C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grouped['C'].agg(res_sum=np.sum,res_mean=np.mean,res_std=np.std)
C:\Users\覃龙\AppData\Local\Temp\ipykernel_4484\3284721652.py:2: FutureWarning: The provided callable <function std at 0x0000025E752A9800> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped['C'].agg(res_sum=np.sum,res_mean=np.mean,res_std=np.std)

      res_sum  res_mean   res_std
A
bar  1.782345  0.594115  1.268599
foo  3.927862  0.785572  0.200658

In [50]:
grouped['C'].agg(res_sum='sum',res_mean='mean',res_std='std')

      res_sum  res_mean   res_std
A
bar  1.782345  0.594115  1.268599
foo  3.927862  0.785572  0.200658

In [51]:
grouped['C'].agg(['sum', 'mean', 'std']).rename(columns={
    'sum': 'res_sum',
    'mean': 'res_mean',
    'std': 'res_std'
})

      res_sum  res_mean   res_std
A
bar  1.782345  0.594115  1.268599
foo  3.927862  0.785572  0.200658